circinusX1/STM32-Excerpts/I2C-PA9-PA10.h
/**
  ******************************************************************************
  * File Name          : I2C.h
  * Description        : This file provides code for the configuration
  *                      of the I2C instances.
  ******************************************************************************
  ** This notice applies to any and all portions of this file
  * that are not between comment pairs USER CODE BEGIN and
  * USER CODE END. Other portions of this file, whether 
  * inserted by the user or by software development tools
  * are owned by their respective copyright owners.
  *
  * COPYRIGHT(c) 2018 STMicroelectronics
  *
  * Redistribution and use in source and binary forms, with or without modification,
  * are permitted provided that the following conditions are met:
  *   1. Redistributions of source code must retain the above copyright notice,
  *      this list of conditions and the following disclaimer.
  *   2. Redistributions in binary form must reproduce the above copyright notice,
  *      this list of conditions and the following disclaimer in the documentation
  *      and/or other materials provided with the distribution.
  *   3. Neither the name of STMicroelectronics nor the names of its contributors
  *      may be used to endorse or promote products derived from this software
  *      without specific prior written permission.
  *
  * THIS SOFTWARE IS PROVIDED BY THE COPYRIGHT HOLDERS AND CONTRIBUTORS "AS IS"
  * AND ANY EXPRESS OR IMPLIED WARRANTIES, INCLUDING, BUT NOT LIMITED TO, THE
  * IMPLIED WARRANTIES OF MERCHANTABILITY AND FITNESS FOR A PARTICULAR PURPOSE ARE
  * DISCLAIMED. IN NO EVENT SHALL THE COPYRIGHT HOLDER OR CONTRIBUTORS BE LIABLE
  * FOR ANY DIRECT, INDIRECT, INCIDENTAL, SPECIAL, EXEMPLARY, OR CONSEQUENTIAL
  * DAMAGES (INCLUDING, BUT NOT LIMITED TO, PROCUREMENT OF SUBSTITUTE GOODS OR
  * SERVICES; LOSS OF USE, DATA, OR PROFITS; OR BUSINESS INTERRUPTION) HOWEVER
  * CAUSED AND ON ANY THEORY OF LIABILITY, WHETHER IN CONTRACT, STRICT LIABILITY,
  * OR TORT (INCLUDING NEGLIGENCE OR OTHERWISE) ARISING IN ANY WAY OUT OF THE USE
  * OF THIS SOFTWARE, EVEN IF ADVISED OF THE POSSIBILITY OF SUCH DAMAGE.
  *
  ******************************************************************************
  */
/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __i2c_H
#define __i2c_H
#ifdef __cplusplus
 extern "C" {
#endif
#include <stdbool.h>
extern bool ERRREPO;

/* Includes ------------------------------------------------------------------*/
#include "stm32f3xx_hal.h"


/* USER CODE BEGIN Includes */
#include "main.h"
#include <stdbool.h>
/* USER CODE END Includes */


/* USER CODE BEGIN Private defines */
#define RW_TOUT     128
#define NO_REGISTER 0xFF

extern I2C_HandleTypeDef hi2c2;
/* USER CODE END Private defines */

extern void _Error_Handler(char *, int);

void MX_I2C2_Init(void);
void MX_I2C3_Init(void);

/* USER CODE BEGIN Prototypes */

uint8_t i2c_read8(int i2cnum, uint16_t address, uint16_t reg);
uint16_t i2c_read16(int i2cnum, uint16_t address, uint16_t reg);
uint32_t i2c_read32(int i2cnum, uint16_t address, uint16_t reg);
bool i2c_readbytes(int i2cnum, uint16_t address, uint16_t reg,  uint8_t* buff, int sz);
bool i2c_writebytes(int i2cnum, uint16_t address, uint16_t reg, uint8_t* buff, int sz);
bool i2c_write8(int i2cnum, uint16_t address, uint16_t reg, const uint8_t val);
bool i2c_write16(int i2cnum, uint16_t address, uint16_t reg, uint16_t val);
uint32_t i2c_read24(int i2cnum, uint16_t address, uint16_t reg);
bool i2c_write32(int i2cnum, uint16_t address, uint16_t reg, uint32_t val);

/* USER CODE END Prototypes */

#ifdef __cplusplus
}
#endif
#endif /*__ i2c_H */

/**
  * @}
  */

/**
  * @}
  */

/************************ (C) COPYRIGHT STMicroelectronics *****END OF FILE****/
